In [1]:
#Assignment_10
import pandas as pd
a=[1,2,3,4,5,6,'Uobs']
print(a)
s1=pd.Series(a)
print(s1)

[1, 2, 3, 4, 5, 6, 'Uobs']
0       1
1       2
2       3
3       4
4       5
5       6
6    Uobs
dtype: object

In [2]:
s2=pd.Series([1,34,32,55,45],index=['I','II','II','IV','V'])
print(s2)

I      1
II    34
II    32
IV    55
V     45
dtype: int64

In [3]:
s2[4]

45

In [4]:
s3=pd.Series([1,34,32,55,45],index=[0,1,2,3,4],dtype=float,name="Series Data Structure")
print(s3)

0     1.0
1    34.0
2    32.0
3    55.0
4    45.0
Name: Series Data Structure, dtype: float64

In [5]:
print(s3[0])
print(min(s3))
print(max(s3))

1.0
1.0
55.0

In [6]:
s3[s3>=9]

1    34.0
2    32.0
3    55.0
4    45.0
Name: Series Data Structure, dtype: float64

In [7]:
s3[1:4]

1    34.0
2    32.0
3    55.0
Name: Series Data Structure, dtype: float64

In [8]:
s3_dict=pd.Series({'Pakistan':'Islamabad','Iraq':'Baqdad','Iran':'Tehran','Afghanistan':'Kabul'})
s3_dict

Pakistan       Islamabad
Iraq              Baqdad
Iran              Tehran
Afghanistan        Kabul
dtype: object

In [9]:
s3_dict[0:3]

Pakistan    Islamabad
Iraq           Baqdad
Iran           Tehran
dtype: object

In [10]:
s3_dict["Pakistan"]

'Islamabad'

In [11]:
s4=pd.Series([11,12,22,33,55],index=[1,2,3,4,5])
s4

1    11
2    12
3    22
4    33
5    55
dtype: int64

In [12]:
print(s3)
print(s4)

0     1.0
1    34.0
2    32.0
3    55.0
4    45.0
Name: Series Data Structure, dtype: float64
1    11
2    12
3    22
4    33
5    55
dtype: int64

In [13]:
s3+s4

0     NaN
1    45.0
2    44.0
3    77.0
4    78.0
5     NaN
dtype: float64

In [14]:
import pandas as pd
list1=['a','b','c']
list1

['a', 'b', 'c']

In [15]:
df1=pd.DataFrame(list1)
df1

   0
0  a
1  b
2  c

In [16]:
list2=[[10,23,45],[7,6]]
print(list2)

[[10, 23, 45], [7, 6]]

In [17]:
df2=pd.DataFrame(list2)
df2

    0   1     2
0  10  23  45.0
1   7   6   NaN

In [18]:
#labtask 11
import pandas as pd
dict1={'No#.':[33,55,66,77]}
print(dict1)
df3= pd.DataFrame(dict1)
print(df3)

{'No#.': [33, 55, 66, 77]}
   No#.
0    33
1    55
2    66
3    77

In [19]:
dict2= {'Country':['Pak','India','Iran','Iraq',],'Capital':['Islamabad','Dehli','Tehran','Baghdad']}
print(dict2)

{'Country': ['Pak', 'India', 'Iran', 'Iraq'], 'Capital': ['Islamabad', 'Dehli', 'Tehran', 'Baghdad']}

In [20]:
df3=pd.DataFrame(dict2)
print(df3)

  Country    Capital
0     Pak  Islamabad
1   India      Dehli
2    Iran     Tehran
3    Iraq    Baghdad

In [21]:
list_dict3=[{'Name':'Abbas','Rollno':121},{'Name':'Ali','Rollno':151}]
print(list_dict3)

[{'Name': 'Abbas', 'Rollno': 121}, {'Name': 'Ali', 'Rollno': 151}]

In [22]:
df5=pd.DataFrame(list_dict3)
print(df5)

    Name  Rollno
0  Abbas     121
1    Ali     151

In [23]:
dict4={'Std_Name':pd.Series(['Muhammad','Abbas','Ali']),'Std_Marks':pd.Series(['99','98','90'])}
df6=pd.DataFrame(dict4)
print(df6)

   Std_Name Std_Marks
0  Muhammad        99
1     Abbas        98
2       Ali        90

In [25]:
#labtask12
import pandas as pd
a=pd.read_csv("table.csv")
print(a)
print(a.columns)
c=pd.read_csv("table.csv",nrows=2)
print(c)
b=pd.read_csv("table.csv",usecols=[0,2])
print(b)
p=pd.read_csv("table.csv",skiprows=1)
print(p)

   StdID Department Percentage
0    101         CS        95%
1    102         CS        87%
2    103         CE        89%
3    104         EE        65%
4    105         CE        90%
Index(['StdID', 'Department', 'Percentage'], dtype='object')
   StdID Department Percentage
0    101         CS        95%
1    102         CS        87%
   StdID Percentage
0    101        95%
1    102        87%
2    103        89%
3    104        65%
4    105        90%
   101  CS  95%
0  102  CS  87%
1  103  CE  89%
2  104  EE  65%
3  105  CE  90%

In [30]:
p=pd.read_csv("table.csv",index_col='StdID')
print(p)

      Department Percentage
StdID
101           CS        95%
102           CS        87%
103           CE        89%
104           EE        65%
105           CE        90%

In [26]:
p=pd.read_csv("table.csv",index_col=1)
print(p)

            StdID Percentage
Department
CS            101        95%
CS            102        87%
CE            103        89%
EE            104        65%
CE            105        90%

In [27]:
q=pd.read_csv("table.csv",header=1)
print(q)

   101  CS  95%
0  102  CS  87%
1  103  CE  89%
2  104  EE  65%
3  105  CE  90%

In [28]:
l=pd.read_csv("table.csv",header=None)
print(l)

       0           1           2
0  StdID  Department  Percentage
1    101          CS         95%
2    102          CS         87%
3    103          CE         89%
4    104          EE         65%
5    105          CE         90%

In [29]:
u=pd.read_csv("table1.csv",header=None,prefix='col_')
print(u)
g=pd.read_csv("table1.csv",names=['EMPID','DEPARTMENT','PERFORMANCE'])
print(g)

   col_0 col_1 col_2
0    101    CS   95%
1    102    CS   87%
2    103    CE   89%
3    104    EE   65%
4    105    CE   90%
   EMPID DEPARTMENT PERFORMANCE
0    101         CS         95%
1    102         CS         87%
2    103         CE         89%
3    104         EE         65%
4    105         CE         90%

C:\Users\Sheher Bano\AppData\Local\Temp\ipykernel_13012\2402516014.py:1: FutureWarning: The prefix argument has been deprecated and will be removed in a future version. Use a list comprehension on the column names in the future.


  u=pd.read_csv("table1.csv",header=None,prefix='col_')

In [32]:
#lab13
import pandas as pd
a= pd.read_csv('stdInfo.csv')
(a)

   stdID Department Percentage
0    101         CS        98%
1    102         CS        54%
2    103         CE        76%
3    104         EE        89%
4    105         CE        65%
5    109         CS        94%
6    122         CE        45%
7    232         EE        54%
8    322         EE        43%

In [33]:
a.head()

   stdID Department Percentage
0    101         CS        98%
1    102         CS        54%
2    103         CE        76%
3    104         EE        89%
4    105         CE        65%

In [34]:
a.head(3)

   stdID Department Percentage
0    101         CS        98%
1    102         CS        54%
2    103         CE        76%

In [35]:
a.tail()

   stdID Department Percentage
4    105         CE        65%
5    109         CS        94%
6    122         CE        45%
7    232         EE        54%
8    322         EE        43%

In [36]:
a.tail(3)

   stdID Department Percentage
6    122         CE        45%
7    232         EE        54%
8    322         EE        43%

In [37]:
#dtype Parameter
a=pd.read_csv('stdInfo.csv', dtype= {'stdID':'float'})
a

   stdID Department Percentage
0  101.0         CS        98%
1  102.0         CS        54%
2  103.0         CE        76%
3  104.0         EE        89%
4  105.0         CE        65%
5  109.0         CS        94%
6  122.0         CE        45%
7  232.0         EE        54%
8  322.0         EE        43%

In [39]:
import pandas as pd
b=pd.read_csv('StdinfoNew.csv')
b

   stdID Department Percentage Selected
0    101         CS        98%      Yes
1    102         CS        54%      Yes
2    103         CE        76%      Yes
3    104         EE        89%      Yes
4    105         CE        65%       No
5    109         CS        94%       No
6    122         CE        45%      Yes
7    232         EE        54%       No
8    322         EE        43%       No

In [40]:
b=pd.read_csv('StdinfoNew.csv', true_values=['Yes'],false_values=['No'])
b

   stdID Department Percentage  Selected
0    101         CS        98%      True
1    102         CS        54%      True
2    103         CE        76%      True
3    104         EE        89%      True
4    105         CE        65%     False
5    109         CS        94%     False
6    122         CE        45%      True
7    232         EE        54%     False
8    322         EE        43%     False

In [41]:
#labNo 14
import pandas as pd
a=pd.read_csv('dipnew1.csv')
a

   StdID Department Percentage   Address
0  101.2         CS        90%       NaN
1  102.0         CS        87%    Khaplu
2    NaN        NaN        95%       NaN
3  103.0         EE        88%       NaN
4    NaN         CE        78%  Kharmang

In [42]:
a=pd.read_csv('dipnew1.csv', na_values='not available')
a

   StdID Department Percentage   Address
0  101.2         CS        90%       NaN
1  102.0         CS        87%    Khaplu
2    NaN        NaN        95%       NaN
3  103.0         EE        88%       NaN
4    NaN         CE        78%  Kharmang

In [43]:
a=pd.read_csv('dipnew1.csv', keep_default_na= False)
print(a)

   StdID Department Percentage   Address
0  101.2         CS        90%
1    102         CS        87%    Khaplu
2                          95%
3    103         EE        88%
4                CE        78%  Kharmang

In [44]:
#lab 15
import pandas as np
import numpy as np
a=pd.read_csv('dipnew1.csv')
print(a)
a.isnull()

   StdID Department Percentage   Address
0  101.2         CS        90%       NaN
1  102.0         CS        87%    Khaplu
2    NaN        NaN        95%       NaN
3  103.0         EE        88%       NaN
4    NaN         CE        78%  Kharmang

   StdID  Department  Percentage  Address
0  False       False       False     True
1  False       False       False    False
2   True        True       False     True
3  False       False       False     True
4   True       False       False    False

In [45]:
a.isnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of    StdID  Department  Percentage  Address
0  False       False       False     True
1  False       False       False    False
2   True        True       False     True
3  False       False       False     True
4   True       False       False    False>

In [48]:
print(a)
print(a.notnull())

   StdID Department Percentage   Address
0  101.2         CS        90%       NaN
1  102.0         CS        87%    Khaplu
2    NaN        NaN        95%       NaN
3  103.0         EE        88%       NaN
4    NaN         CE        78%  Kharmang
   StdID  Department  Percentage  Address
0   True        True        True    False
1   True        True        True     True
2  False       False        True    False
3   True        True        True    False
4  False        True        True     True

In [49]:
a.notnull().sum()

StdID         3
Department    4
Percentage    5
Address       2
dtype: int64

In [50]:
#lab 16
import pandas as pd
a=pd.read_csv('dipnew1.csv')
a

   StdID Department Percentage   Address
0  101.2         CS        90%       NaN
1  102.0         CS        87%    Khaplu
2    NaN        NaN        95%       NaN
3  103.0         EE        88%       NaN
4    NaN         CE        78%  Kharmang

In [51]:
a.dropna()

   StdID Department Percentage Address
1  102.0         CS        87%  Khaplu

In [52]:
a.dropna(how='all',axis=0)

   StdID Department Percentage   Address
0  101.2         CS        90%       NaN
1  102.0         CS        87%    Khaplu
2    NaN        NaN        95%       NaN
3  103.0         EE        88%       NaN
4    NaN         CE        78%  Kharmang

In [53]:
a.dropna(axis=1)

  Percentage
0        90%
1        87%
2        95%
3        88%
4        78%

In [54]:
a.dropna(thresh=3)

   StdID Department Percentage   Address
0  101.2         CS        90%       NaN
1  102.0         CS        87%    Khaplu
3  103.0         EE        88%       NaN
4    NaN         CE        78%  Kharmang

In [55]:
a.dropna(thresh=3, axis=1)

   StdID Department Percentage
0  101.2         CS        90%
1  102.0         CS        87%
2    NaN        NaN        95%
3  103.0         EE        88%
4    NaN         CE        78%

In [56]:
a.dropna(subset=['Department','Address'])

   StdID Department Percentage   Address
1  102.0         CS        87%    Khaplu
4    NaN         CE        78%  Kharmang

In [57]:
print(a.dropna(inplace= True))

None

In [58]:
#lab 17
import pandas as pd
a= pd.read_csv('dipnew1.csv')
print(a)

   StdID Department Percentage   Address
0  101.2         CS        90%       NaN
1  102.0         CS        87%    Khaplu
2    NaN        NaN        95%       NaN
3  103.0         EE        88%       NaN
4    NaN         CE        78%  Kharmang

In [59]:
a.fillna('bano')

   StdID Department Percentage   Address
0  101.2         CS        90%      bano
1  102.0         CS        87%    Khaplu
2   bano       bano        95%      bano
3  103.0         EE        88%      bano
4   bano         CE        78%  Kharmang

In [60]:
a.fillna(2)

   StdID Department Percentage   Address
0  101.2         CS        90%         2
1  102.0         CS        87%    Khaplu
2    2.0          2        95%         2
3  103.0         EE        88%         2
4    2.0         CE        78%  Kharmang

In [61]:
a.fillna({'Department':'SE','Address':'Gilgit'})

   StdID Department Percentage   Address
0  101.2         CS        90%    Gilgit
1  102.0         CS        87%    Khaplu
2    NaN         SE        95%    Gilgit
3  103.0         EE        88%    Gilgit
4    NaN         CE        78%  Kharmang

In [62]:
a.fillna(method='bfill')

   StdID Department Percentage   Address
0  101.2         CS        90%    Khaplu
1  102.0         CS        87%    Khaplu
2  103.0         EE        95%  Kharmang
3  103.0         EE        88%  Kharmang
4    NaN         CE        78%  Kharmang

In [63]:
a.fillna(method='ffill')

   StdID Department Percentage   Address
0  101.2         CS        90%       NaN
1  102.0         CS        87%    Khaplu
2  102.0         CS        95%    Khaplu
3  103.0         EE        88%    Khaplu
4  103.0         CE        78%  Kharmang

In [64]:
a.fillna(0,limit=1)

   StdID Department Percentage   Address
0  101.2         CS        90%         0
1  102.0         CS        87%    Khaplu
2    0.0          0        95%       NaN
3  103.0         EE        88%       NaN
4    NaN         CE        78%  Kharmang

In [65]:
a.fillna('abc',inplace=True)
a

   StdID Department Percentage   Address
0  101.2         CS        90%       abc
1  102.0         CS        87%    Khaplu
2    abc        abc        95%       abc
3  103.0         EE        88%       abc
4    abc         CE        78%  Kharmang

In [66]:
#lab 18
a=pd.read_csv('stdInfo.csv')
a

   stdID Department Percentage
0    101         CS        98%
1    102         CS        54%
2    103         CE        76%
3    104         EE        89%
4    105         CE        65%
5    109         CS        94%
6    122         CE        45%
7    232         EE        54%
8    322         EE        43%

In [67]:
a.replace(to_replace='CE',value='SE')

   stdID Department Percentage
0    101         CS        98%
1    102         CS        54%
2    103         SE        76%
3    104         EE        89%
4    105         SE        65%
5    109         CS        94%
6    122         SE        45%
7    232         EE        54%
8    322         EE        43%

In [68]:
a.replace('CS','SE')

   stdID Department Percentage
0    101         SE        98%
1    102         SE        54%
2    103         CE        76%
3    104         EE        89%
4    105         CE        65%
5    109         SE        94%
6    122         CE        45%
7    232         EE        54%
8    322         EE        43%

In [69]:
a.replace([103,105],'CE-111')

    stdID Department Percentage
0     101         CS        98%
1     102         CS        54%
2  CE-111         CE        76%
3     104         EE        89%
4  CE-111         CE        65%
5     109         CS        94%
6     122         CE        45%
7     232         EE        54%
8     322         EE        43%

In [71]:
#lab 19
import pandas as pd
a= pd.read_csv('dipnew.csv')
print(a)

   StdID Department Percentage   Address
0  101.0         CS        90%       NaN
1    NaN         CS        87%    Khaplu
2  103.0        NaN        95%       NaN
3  104.0         EE        88%       NaN
4  105.0         CE        78%  Kharmang

In [72]:
a.interpolate(method='linear')

   StdID Department Percentage   Address
0  101.0         CS        90%       NaN
1  102.0         CS        87%    Khaplu
2  103.0        NaN        95%       NaN
3  104.0         EE        88%       NaN
4  105.0         CE        78%  Kharmang

In [73]:
b=pd.read_csv('dates.csv')
b

      joining Deparment  Strength
0   3/10/2022      Math     100.0
1   1/10/2023  Computer       NaN
2  27/10/2022   Physics     250.0
3  25/10/2025   English       NaN
4   1/11/2025   Biology    1500.0

In [74]:
type(b.joining[0])

str

In [75]:
b=pd.read_csv('dates.csv' ,parse_dates=['joining'])
b

C:\Users\Sheher Bano\AppData\Local\Temp\ipykernel_13012\2206568235.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  b=pd.read_csv('dates.csv' ,parse_dates=['joining'])

     joining Deparment  Strength
0 2022-03-10      Math     100.0
1 2023-01-10  Computer       NaN
2 2022-10-27   Physics     250.0
3 2025-10-25   English       NaN
4 2025-01-11   Biology    1500.0

In [76]:
type(b)

pandas.core.frame.DataFrame

In [77]:
b=pd.read_csv('dates.csv', parse_dates=['joining'],index_col='joining')
b

C:\Users\Sheher Bano\AppData\Local\Temp\ipykernel_13012\457545980.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  b=pd.read_csv('dates.csv', parse_dates=['joining'],index_col='joining')

           Deparment  Strength
joining
2022-03-10      Math     100.0
2023-01-10  Computer       NaN
2022-10-27   Physics     250.0
2025-10-25   English       NaN
2025-01-11   Biology    1500.0

In [79]:
c=pd.read_csv('stdD.csv')
c

    subject  Strength  Class
0      Math     100.0      2
1  Computer       NaN      4
2   Physics     250.0      3
3   English    1500.0      4
4   Biology       NaN      3
5   History    1600.0      2

In [80]:
c=pd.read_csv('stdD.csv',index_col="Class")
c

        subject  Strength
Class
2          Math     100.0
4      Computer       NaN
3       Physics     250.0
4       English    1500.0
3       Biology       NaN
2       History    1600.0

In [81]:
c.interpolate(method='index')

        subject  Strength
Class
2          Math     100.0
4      Computer    1500.0
3       Physics     250.0
4       English    1500.0
3       Biology     250.0
2       History    1600.0

In [82]:
c.interpolate(method='nearest')

        subject  Strength
Class
2          Math     100.0
4      Computer    1500.0
3       Physics     250.0
4       English    1500.0
3       Biology     250.0
2       History    1600.0

In [83]:
#lab20
import pandas as pd
a=pd.DataFrame([[12,15,22,'black'],[14,12,33,'black'],[16,14,45,'green'],[17,13,45,'white'],[15,14,55,'green']],
               index=['cobra','viper','sidewinder','anaconda','python'],
               columns=['maxspeed','Sheild','Age','Color'])
print(a)

            maxspeed  Sheild  Age  Color
cobra             12      15   22  black
viper             14      12   33  black
sidewinder        16      14   45  green
anaconda          17      13   45  white
python            15      14   55  green

In [84]:
b.interpolate(method='time')

           Deparment     Strength
joining
2022-03-10      Math   100.000000
2023-01-10  Computer   366.171004
2022-10-27   Physics   250.000000
2025-10-25   English  1500.000000
2025-01-11   Biology  1500.000000

In [85]:
a.loc[['cobra']]

       maxspeed  Sheild  Age  Color
cobra        12      15   22  black

In [86]:
a.loc[['cobra','viper']]

       maxspeed  Sheild  Age  Color
cobra        12      15   22  black
viper        14      12   33  black

In [87]:
a.loc['cobra','Sheild']

15

In [88]:
a.loc[['cobra','sidewinder'],['Sheild','Color']]

            Sheild  Color
cobra           15  black
sidewinder      14  green

In [89]:
a.loc[:,'Age']

cobra         22
viper         33
sidewinder    45
anaconda      45
python        55
Name: Age, dtype: int64

In [90]:
a.loc[a['Age']>34,['maxspeed']]

            maxspeed
sidewinder        16
anaconda          17
python            15

In [91]:
a.loc['viper':'anaconda','maxspeed']

viper         14
sidewinder    16
anaconda      17
Name: maxspeed, dtype: int64

In [92]:
a.loc[ lambda a:a['Color']=='green']

            maxspeed  Sheild  Age  Color
sidewinder        16      14   45  green
python            15      14   55  green

In [93]:
a.loc[lambda a:a['Age']>9,['Age','maxspeed','Color']]

            Age  maxspeed  Color
cobra        22        12  black
viper        33        14  black
sidewinder   45        16  green
anaconda     45        17  white
python       55        15  green

In [94]:
a.iloc[0:2,:]

       maxspeed  Sheild  Age  Color
cobra        12      15   22  black
viper        14      12   33  black

In [95]:
a.loc['cobra':'sidewinder',:]

            maxspeed  Sheild  Age  Color
cobra             12      15   22  black
viper             14      12   33  black
sidewinder        16      14   45  green

In [96]:
a.iloc[0:2,1:3]
print(a)

            maxspeed  Sheild  Age  Color
cobra             12      15   22  black
viper             14      12   33  black
sidewinder        16      14   45  green
anaconda          17      13   45  white
python            15      14   55  green

In [98]:
a.iloc[[0,4],[1,3]]

        Sheild  Color
cobra       15  black
python      14  green

In [97]:
a.iloc[[True,False,False,True,False]]

          maxspeed  Sheild  Age  Color
cobra           12      15   22  black
anaconda        17      13   45  white

In [99]:
a.loc[[True,True,True,True,False],
[False,True,True,False]]

            Sheild  Age
cobra           15   22
viper           12   33
sidewinder      14   45
anaconda        13   45

In [100]:
#lab 21
import pandas as pd
a= pd.DataFrame({'ID':[121,122,123,124],'Marks':[88,99,77,65]})
a

    ID  Marks
0  121     88
1  122     99
2  123     77
3  124     65

In [101]:
b= pd.DataFrame({'ID':[121,122,123,124],'Name':['Ali','Hassan','Abbas','Muhammmad']})
b

    ID       Name
0  121        Ali
1  122     Hassan
2  123      Abbas
3  124  Muhammmad

In [102]:
pd.merge(a,b, on='ID')

    ID  Marks       Name
0  121     88        Ali
1  122     99     Hassan
2  123     77      Abbas
3  124     65  Muhammmad

In [103]:
c= pd.DataFrame({'ID':[121,122,123,124],'Marks':[88,99,77,65]})
d= pd.DataFrame({'ID':[121,122,123,124],'Name':['Ali','Hassan','Abbas','Muhammmad']})
pd.concat([c,d])

    ID  Marks       Name
0  121   88.0        NaN
1  122   99.0        NaN
2  123   77.0        NaN
3  124   65.0        NaN
0  121    NaN        Ali
1  122    NaN     Hassan
2  123    NaN      Abbas
3  124    NaN  Muhammmad

In [104]:
pd.concat([c,d], axis=1)

    ID  Marks   ID       Name
0  121     88  121        Ali
1  122     99  122     Hassan
2  123     77  123      Abbas
3  124     65  124  Muhammmad

In [105]:
a=pd.read_csv('StdinfoNew.csv')

In [106]:
a

   stdID Department Percentage Selected
0    101         CS        98%      Yes
1    102         CS        54%      Yes
2    103         CE        76%      Yes
3    104         EE        89%      Yes
4    105         CE        65%       No
5    109         CS        94%       No
6    122         CE        45%      Yes
7    232         EE        54%       No
8    322         EE        43%       No

In [107]:
a.pivot_table(index='Department')

C:\Users\Sheher Bano\AppData\Local\Temp\ipykernel_13012\2544909846.py:1: FutureWarning: pivot_table dropped a column because it failed to aggregate. This behavior is deprecated and will raise in a future version of pandas. Select only the columns that can be aggregated.
  a.pivot_table(index='Department')

                 stdID
Department
CE          110.000000
CS          104.000000
EE          219.333333